sensorOpt/4.5deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       214817;
    }
    right
    {
        type            patch;
        nFaces          200;
        startFace       215217;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       215417;
    }
    left
    {
        type            patch;
        nFaces          200;
        startFace       215817;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          107562;
        startFace       216017;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          107562;
        startFace       323579;
    }
    wing
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          433;
        startFace       431141;
    }
)

// ************************************************************************* //
